results/exp1/20260224T024240Z-direct-nginx/raw/wrk/c128/run-4.txt
Running 1m test @ http://192.168.100.1:8080/exp1-1k.txt
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   460.05us   89.00us   3.10ms   73.78%
    Req/Sec    68.82k     5.56k   77.03k    77.67%
  Latency Distribution
     50%  445.00us
     75%  504.00us
     90%  589.00us
     99%  700.00us
  16433425 requests in 1.00m, 19.48GB read
Requests/sec: 273819.15
Transfer/sec:    332.42MB